 
"noInternetConnectionError" = "It seems you're not connected to the internet. Please check your internet connection and try again.";
"timeoutError" = "Sorry, the operation took longer than expected. Please check your internet connection and try again. If the issue persists, please contact support.";
"invalidURLError" = "Invalid URL provided '%@' . Please double-check the URL and try again, or contact support if the issue persists.";
"requestFailedError" = "something went wrong with the network. Please check your connection, try again later, or contact support if the issue persists.";
"encodingDataError" = "Unable to encode request data";
"decodingFailedError" = "an error occured in server data please try again later, or contact support if the issue persists.";
"serverError" = "Oops, we've encountered a server response error, please try again later";
